Revit 2024 API
ConnectionValidationWarning.Resolution Property
 Enumeration for resolution that was applied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public ConnectionResolution Resolution { get; }
Visual Basic
Public ReadOnly Property Resolution As ConnectionResolution
	Get
Visual C++
public:
property ConnectionResolution Resolution {
	ConnectionResolution get ();
}
See Also
ConnectionValidationWarning Class
Autodesk.Revit.DB Namespace